In [1]:
import pandas as pd
import numpy as np
import seaborn as np
import os

In [2]:
#upload data to jupyter
extra2 = pd.read_csv(r'C:\Users\Azra\Documents\Shopee Project\20200530 BestCoder Project\2. Prepared Data\20200530 Pre-Tretiary\ptr-rd1\Extra_material_2.csv')
extra3 = pd.read_csv(r'C:\Users\Azra\Documents\Shopee Project\20200530 BestCoder Project\2. Prepared Data\20200530 Pre-Tretiary\ptr-rd1\Extra_material_3.csv')
extra3 = extra3.rename(columns={'shopid':'shop_id'})

In [3]:
#check each head of data
#extra2.head()
#extra3.head()

In [4]:
#delete data that don't have date time in extra3
extra3_new = extra3[pd.notnull(extra3.date_id)]
#checking
extra3_new

            orderid      itemid    date_id  amount  item_price_usd    shop_id
0        1316773501  1355135789  16/5/2019       1        5.483204   65948755
1        1316774684  1257902741  16/5/2019       1        0.387050   61364537
2        1316803330  2126770455  16/5/2019       1        0.344044    4980129
3        1317196434  2112999088  16/5/2019       1        6.704561   29089750
4        1318105348  1832131969  16/5/2019       1        5.354187   94372493
...             ...         ...        ...     ...             ...        ...
1048570  1282783920  2117708081   5/5/2019       1        2.451315   36050398
1048571  1282784581  2073505055   5/5/2019       1        1.311668  133389379
1048572  1282794723  1074306637   5/5/2019       1        1.161149   58327801
1048573  1282806746  1279044775   5/5/2019       1       30.060860   26210794
1048574  1282810258  1560947671   5/5/2019       1        3.096398   58110183

[1048575 rows x 6 columns]

In [5]:
#changing type for date, orderid, itemid in extra3_new
extra3_new['date_id'] = pd.to_datetime(extra3_new['date_id'], format='%d/%m/%Y')
extra3_new['orderid'] = extra3_new['orderid'].astype(int)
extra3_new['itemid'] = extra3_new['itemid'].astype(int)
extra3_new['shop_id'] = extra3_new['shop_id'].astype(int)

#changing type for date, orderid, itemid in extra2
extra2['shop_id'] = extra2['shop_id'].astype(int)
extra3_new.info

<bound method DataFrame.info of             orderid      itemid    date_id  amount  item_price_usd    shop_id
0        1316773501  1355135789 2019-05-16       1        5.483204   65948755
1        1316774684  1257902741 2019-05-16       1        0.387050   61364537
2        1316803330  2126770455 2019-05-16       1        0.344044    4980129
3        1317196434  2112999088 2019-05-16       1        6.704561   29089750
4        1318105348  1832131969 2019-05-16       1        5.354187   94372493
...             ...         ...        ...     ...             ...        ...
1048570  1282783920  2117708081 2019-05-05       1        2.451315   36050398
1048571  1282784581  2073505055 2019-05-05       1        1.311668  133389379
1048572  1282794723  1074306637 2019-05-05       1        1.161149   58327801
1048573  1282806746  1279044775 2019-05-05       1       30.060860   26210794
1048574  1282810258  1560947671 2019-05-05       1        3.096398   58110183

[1048575 rows x 6 columns]>

In [6]:
extra2['shop_id'].dtype

dtype('int32')

In [7]:
#selecting a range of date in extra_3_new (10-31 May 2019)
extra3_new_1=extra3_new[(extra3_new.date_id>='2019-05-10') & (extra3_new.date_id<='2019-05-31')]
extra3_new_1

           orderid      itemid    date_id  amount  item_price_usd   shop_id
0       1316773501  1355135789 2019-05-16       1        5.483204  65948755
1       1316774684  1257902741 2019-05-16       1        0.387050  61364537
2       1316803330  2126770455 2019-05-16       1        0.344044   4980129
3       1317196434  2112999088 2019-05-16       1        6.704561  29089750
4       1318105348  1832131969 2019-05-16       1        5.354187  94372493
...            ...         ...        ...     ...             ...       ...
977066  1377703655  1286506704 2019-05-29       1        2.924375  73789223
977067  1377741389  1726943954 2019-05-29       2       18.062319  52323543
977068  1377744165   423611298 2019-05-29       1        4.300552  20187300
977069  1377759268  1420094546 2019-05-29       1       13.976795  46595353
977070  1377766435   237867635 2019-05-29       1       23.179976  21180592

[706482 rows x 6 columns]

In [8]:
#combining both data into one dataframe
combined=pd.merge(left = extra2,right = extra3_new_1,how='left',left_on='shop_id',right_on='shop_id')

In [9]:
combined = combined.reset_index()
combined

,index,shop_id,brand,shop_type,orderid,itemid,date_id,amount,item_price_usd
0,0,92567513,JBL,Official Shop,NaN,NaN,NaT,NaN,NaN
1,1,1657263,Sandisk,Official Shop,NaN,NaN,NaT,NaN,NaN
2,2,83401047,Revlon,Official Shop,NaN,NaN,NaT,NaN,NaN
3,3,4259661,Philips,Official Shop,NaN,NaN,NaT,NaN,NaN
4,4,4350106,Kimberly Clark,Official Shop,NaN,NaN,NaT,NaN,NaN
...,...,...,...,...,...,...,...,...,...
3304970,3304970,44671618,Nyx Professional,NaN,1.333046e+09,722996198.0,2019-05-19,1.0,5.977768
3304971,3304971,44671618,Nyx Professional,NaN,1.333054e+09,722996198.0,2019-05-19,1.0,5.977768
3304972,3304972,45237836,Colgate,NaN,NaN,NaN,NaT,NaN,NaN
3304973,3304973,45330974,Bata,NaN,NaN,NaN,NaT,NaN,NaN
3304974,3304974,45394315,Huawei,NaN,NaN,NaN,NaT,NaN,NaN

In [10]:
#combined[combined['itemid']=='-2115884395']
combined['shop_id'].dtype

dtype('int32')

In [11]:
#counting brand again 
combined.brand.value_counts()

Johnson & Johnson    454670
SMart                391014
P&G                  363113
Loreal               332398
Maybelline           241488
                      ...
Sofina                   33
Dugro                    33
John Frieda              33
Quaker                   33
Lenovo / Mobile          13
Name: brand, Length: 270, dtype: int64

In [12]:
combined[pd.isnull(combined['date_id'])]
#kesimpulan = there are brand that is not selling items in this range of date

,index,shop_id,brand,shop_type,orderid,itemid,date_id,amount,item_price_usd
0,0,92567513,JBL,Official Shop,NaN,NaN,NaT,NaN,NaN
1,1,1657263,Sandisk,Official Shop,NaN,NaN,NaT,NaN,NaN
2,2,83401047,Revlon,Official Shop,NaN,NaN,NaT,NaN,NaN
3,3,4259661,Philips,Official Shop,NaN,NaN,NaT,NaN,NaN
4,4,4350106,Kimberly Clark,Official Shop,NaN,NaN,NaT,NaN,NaN
...,...,...,...,...,...,...,...,...,...
3304962,3304962,43719124,Nestle Food,NaN,NaN,NaN,NaT,NaN,NaN
3304963,3304963,44437739,P&G,NaN,NaN,NaN,NaT,NaN,NaN
3304972,3304972,45237836,Colgate,NaN,NaN,NaN,NaT,NaN,NaN
3304973,3304973,45330974,Bata,NaN,NaN,NaN,NaT,NaN,NaN
3304974,3304974,45394315,Huawei,NaN,NaN,NaN,NaT,NaN,NaN

In [13]:
# bikin kolom baru mengenai gross value
combined['gross'] = combined['amount'] *combined['item_price_usd']
combined

,index,shop_id,brand,shop_type,orderid,itemid,date_id,amount,item_price_usd,gross
0,0,92567513,JBL,Official Shop,NaN,NaN,NaT,NaN,NaN,NaN
1,1,1657263,Sandisk,Official Shop,NaN,NaN,NaT,NaN,NaN,NaN
2,2,83401047,Revlon,Official Shop,NaN,NaN,NaT,NaN,NaN,NaN
3,3,4259661,Philips,Official Shop,NaN,NaN,NaT,NaN,NaN,NaN
4,4,4350106,Kimberly Clark,Official Shop,NaN,NaN,NaT,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
3304970,3304970,44671618,Nyx Professional,NaN,1.333046e+09,722996198.0,2019-05-19,1.0,5.977768,5.977768
3304971,3304971,44671618,Nyx Professional,NaN,1.333054e+09,722996198.0,2019-05-19,1.0,5.977768,5.977768
3304972,3304972,45237836,Colgate,NaN,NaN,NaN,NaT,NaN,NaN,NaN
3304973,3304973,45330974,Bata,NaN,NaN,NaN,NaT,NaN,NaN,NaN
3304974,3304974,45394315,Huawei,NaN,NaN,NaN,NaT,NaN,NaN,NaN

In [14]:
#total gross for every itemid grouped by brand
new =combined.groupby(['brand','itemid']).gross.sum().reset_index()

In [15]:
#sorted data from highest gross to lowest
fixed_data = new.sort_values(by=['brand','gross'],ascending=False).groupby('brand').head(3)

In [16]:
fixed_data

      brand        itemid          gross
1877  eMart  2.000755e+09  247731.158603
1886  eMart  2.046259e+09  210490.526927
1887  eMart  2.046281e+09  101251.340645
1782     Za  3.659811e+08   22053.704693
1788     Za  1.074619e+09   10883.450433
...     ...           ...            ...
36     ASUS  2.046281e+09   11294.970271
30     ASUS  1.738132e+09    5888.316059
1       AHC  1.617870e+09    8484.129360
2       AHC  1.617870e+09    3659.941936
0       AHC  1.617870e+09    2313.008989

[162 rows x 3 columns]

In [17]:
#include all brand in fixed data
##create a series of brand
brands = pd.Series(extra2['brand'])

In [18]:
##merging fixed data with brands
fixed=pd.merge(left = fixed_data,right = brands,how='outer',left_on='brand',right_on='brand')

In [19]:
fixed

                     brand        itemid          gross
0                    eMart  2.000755e+09  247731.158603
1                    eMart  2.000755e+09  247731.158603
2                    eMart  2.000755e+09  247731.158603
3                    eMart  2.000755e+09  247731.158603
4                    eMart  2.000755e+09  247731.158603
...                    ...           ...            ...
328167  Lenovo / Computers           NaN            NaN
328168  Lenovo / Computers           NaN            NaN
328169  Lenovo / Computers           NaN            NaN
328170  Lenovo / Computers           NaN            NaN
328171  Lenovo / Computers           NaN            NaN

[328172 rows x 3 columns]

In [20]:
#drop duplicates
fixed_1 = fixed.drop_duplicates(subset=['brand','itemid', 'gross'], keep='first')

In [21]:
fixed_1

                     brand        itemid          gross
0                    eMart  2.000755e+09  247731.158603
502                  eMart  2.046259e+09  210490.526927
1004                 eMart  2.046281e+09  101251.340645
1506                    Za  3.659811e+08   22053.704693
1893                    Za  1.074619e+09   10883.450433
...                    ...           ...            ...
327710              Aveeno           NaN            NaN
327824  Shiseido PC Brands           NaN            NaN
327967          Beiersdorf           NaN            NaN
328094     Lenovo / Mobile           NaN            NaN
328107  Lenovo / Computers           NaN            NaN

[373 rows x 3 columns]

In [22]:
fixed_1.itemid=fixed_1.itemid.fillna(0)
fixed_1.itemid=fixed_1.itemid.astype(int)
fixed_1.itemid=fixed_1.itemid.astype(str)
fixed_1.itemid=fixed_1.itemid.replace('0','N.A')

C:\Users\Azra\miniconda3\envs\tensorflow\lib\site-packages\pandas\core\generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [23]:
fixed_1

                     brand      itemid          gross
0                    eMart  2000755197  247731.158603
502                  eMart  2046258587  210490.526927
1004                 eMart  2046281478  101251.340645
1506                    Za   365981058   22053.704693
1893                    Za  1074619349   10883.450433
...                    ...         ...            ...
327710              Aveeno         N.A            NaN
327824  Shiseido PC Brands         N.A            NaN
327967          Beiersdorf         N.A            NaN
328094     Lenovo / Mobile         N.A            NaN
328107  Lenovo / Computers         N.A            NaN

[373 rows x 3 columns]

In [24]:
fixed_2=fixed_1.groupby('brand')['itemid'].apply(', '.join).reset_index()
fixed_2['Answers'] = fixed_2['brand'].str.cat(fixed_2['itemid'],sep=", ")

In [25]:
fixed_2[fixed_2['brand']=='Anker']

,brand,itemid,Answers
10,Anker,"-2115884395, 214476390, 1985117325","Anker, -2115884395, 214476390, 1985117325"

In [26]:
extra3[extra3['orderid']==1332946287]

           orderid      itemid    date_id  amount  item_price_usd   shop_id
139082  1332946287  2179082901  19/5/2019       1        68.37878  16461019

In [27]:
fixed_2[fixed_2['brand']=='Colgate']

,brand,itemid,Answers
43,Colgate,"-2016779889, -2016779887, -2016779862","Colgate, -2016779889, -2016779887, -2016779862"

In [28]:
jawaban = pd.Series(fixed_2['Answers']).reset_index()

In [29]:
jawaban

     index                                          Answers
0        0                                          3M, N.A
1        1                                 3M Littmann, N.A
2        2          AHC, 1617870234, 1617870245, 1617870178
3        3         ASUS, 2046258587, 2046281478, 1738131639
4        4       Abbott, 1437756029, 1414181351, 1414181383
..     ...                                              ...
265    265                            Wyeth Nutrition , N.A
266    266        Xiaomi, 1373245117, 967538060, 1913571916
267    267  Yves Rocher, 1719453583, 1719453786, 2109554227
268    268             Za, 365981058, 1074619349, 365980821
269    269        eMart, 2000755197, 2046258587, 2046281478

[270 rows x 2 columns]

In [30]:
jawaban.to_csv(r'C:\Users\Azra\Documents\Shopee Project\20200530 BestCoder Project\3. Uploaded Data\jawaban.csv')

PermissionError: [Errno 13] Permission denied: 'C:\\Users\\Azra\\Documents\\Shopee Project\\20200530 BestCoder Project\\3. Uploaded Data\\jawaban.csv'